Repository: 0000-bigtree/xadmin
Catalog: docs/locale/*/LC_MESSAGES/feature.po
Languages: es_es, zh_tw

source: Xadmin 的功能特性
es_es: Características de Xadmin

source: 兼容 Django Admin
es_es: Compatible con la versión original del panel de administración de Django
zh_tw: 相容 Django Admin

source: 使用 Bootstrap 作为 UI 框架
es_es: Usa Bootstrap como UI framework
zh_tw: 使用 Bootstrap 作為UI 框架

source: 编辑页面灵活布局
es_es: Aspecto flexible y configurable
zh_tw: 編輯頁面靈活排版

source: 主页面仪表盘及小部件
es_es: Dashboard y widgets en la página principal
zh_tw: 主頁面儀表板及小元件

source: Font Icon 以及 Model Icon
es_es: Iconos en las Fuentes y Modelos
zh_tw: Font Icon 和 Model Icon

source: 即时编辑
es_es: Edición rápida
zh_tw: 即時編輯

source: 图表功能
es_es: Gráficas
zh_tw: 圖表功能

source: 关联信息菜单
es_es: menú de información relacionada
zh_tw: 相關訊息功能表

source: 数据版本管理
es_es: Control de versiones
zh_tw: 資料版本管理

source: 数据详情页面
es_es: Vistas detalladas
zh_tw: 資料詳情頁面

source: 数据查看权限
es_es: Control de acceso para visualizar
zh_tw: 資料查看權限

source: 过滤器强化
es_es: Filtros mejorados
zh_tw: 篩選強化

source: 书签功能
es_es: Favoritos
zh_tw: 書籤功能

source: 数据导出
es_es: Exportado de datos
zh_tw: 資料匯出

source: Autocomplete
es_es: Autocompletado
zh_tw: 自動完成

source: Inline 数据编辑
es_es: Edición inline
zh_tw: Inline 資料編輯

source: 数据添加向导
es_es: Asistentes para la introducción de datos
zh_tw: 資料新增引導

source: 强大的插件机制
es_es: Sistema potente de plugins
zh_tw: 強大的Plugin機制
