Repository: 0000-bigtree/xadmin
Catalog: docs/locale/*/LC_MESSAGES/index.po
Languages: es_mx

source: Welcome to Django Xadmin's Documentation!
es_mx: Bienvenido a la documentación de Django Xadmin

source: **不能错过的替代Django Admin的产品**.
es_mx: **Un reemplazo del administrador de Django que Usted no debe perderse**

source: 安装 & 设置
es_mx: Instalación y configuración

source: 功能特性
es_mx: Características

source: 插件
es_mx: Plugins

source: 帮助
es_mx: Ayuda

source: 源码
es_mx: Código fuente

source: 网站
es_mx: Sitio web

source: Versions and Compatibility
es_mx: Versiones y compatibilidad

source: Indices and tables
es_mx: Índices y tablas
