Repository: 0000-bigtree/xadmin
Catalog: docs/locale/*/LC_MESSAGES/plugins.po
Languages: tr

source: |xadmin| 的插件
tr: |xadmin| eklentileri

source: 插件概述
tr: eklentilere bakış

source: 内置插件
tr: hazır eklentiler

source: Action
tr: Aksiyon

source: 功能
tr: fonksiyonlar

source: Action 插件在数据列表页面提供了数据选择功能, 选择后的数据可以经过 Action 做特殊的处理. 默认提供的 Action 为批量删除功能.
tr: Aksiyon eklentisi veri listeleme sayfasında veri seçimi fonksiyonalitesi sağlar. Seçilen veri sonrasında Aksiyon tarafından işlenebilir. Toplu silme fonksiyonalitesi öntanımlı Aksiyon olarak tanımlanmıştır.

source: 截图
tr: ekran görüntüsü

source: 使用
tr: kullanım

source: 开发者可以设置 Model OptionClass 的 actions 属性, 该属性是一个列表, 包含您想启用的 Action 的类. 系统已经默认内置了删除数据的 Action, 当然您可以自己制作 Action 来实现特定的功能, 制作 Action 的实例如下.
tr: Aksiyon Eklentisini etkinleştirmek için, geliştirici Model OptionClass'ta liste olarak tanımlı olan 'actions' attribute'unu değiştirebilir. Öntanımlı olarak, xadmin seçili maddeler liste görünümü üzerinden silen DeleteSelectedAction'ı aktive etmiştir. Bunun yanı sıra, özelleştirilmiş Action sınıflarınızı da oluşturabilirsiniz. Aşağıdaki örneğe bakınız.

source: 首先要创建一个 Action 类, 该类需要继承 BaseActionView. BaseActionView 是 :class:`~xadmin.views.ModelAdminView` 的子类::
tr: Öncelikle BaseActionView'den türeyen bir Action sınıfına ihtiyacınız bulunmaktadır. BaseActionView :class:`~xadmin.views.ModelAdminView`'in alt sınıfıdır::

source: 然后在 Model 的 OptionClass 中使用这个 Action::
tr: sonrasında Model içerisindeki OptionClass'ta bu Aksiyonu uygulayın ::

source: 这样就完成了自己的 Action
tr: böylelikle Aksiyonunuzu tamamlamış bulunuyorsunuz.

source: 数据过滤器
tr: veri filtreleri

source: 在数据列表页面提供数据过滤功能, 包括: 模糊搜索, 数字范围搜索, 日期搜索等等
tr: Liste view'ı, veriyi fuzzy sorgulama, nümerik aralık, tarih aralığı gibi girdiler ile filtreleyebilmeniz için veri filtreleme fonksiyonu sunmaktadır.

source: 在 Model OptionClass 中设置以下属性:
tr: Model OptionClass'ta aşağıdaki attribute'ları ayarlayın:

source: ``list_filter`` 属性:
tr: ``list_filter`` özelliği

source: 该属性指定可以过滤的列的名字, 系统会自动生成搜索器
tr: Bu özellik filtrelenecek kolonun adını belirlemekte kullanılır ve sistem buna göre otomatik bir arama cümleciği oluşturur

source: ``search_fields`` 属性:
tr: ``search_fields`` özelliği

source: ``free_query_filter`` 属性:
tr: ``free_query_filter`` özelliği

source: 默认为 ``True`` , 指定是否可以自由搜索. 如果开启自有搜索, 用户可以通过 url 参数来进行特定的搜索, 例如::
tr: Öntanımlı olarak `True``, serbest sorgulamanın izin verily verilmemesini belirtir. Serbest sorgulama açıksa, kullanıcılar argüman adresine değer geçerek özelleştirilmiş sorgular yapabilir. Örneğin :

source: 使用过滤器的例子::
tr: Filtre kullanan örnekler :

source: 版本
tr: versiyon

source: 暂无
tr: geçici olarak erişilemez

source: 制作过滤器
tr: filtre oluştur

source: 您也可以制作自己的过滤器, 用来进行一些特定的过滤. 过滤器需要继承 :class:`xadmin.filters.BaseFilter` 类, 并使用 :attr:`xadmin.filters.manager` 注册过滤器.
tr: Özelleştirilmiş filtrelemeler için kendi filtrelerinizi oluşturabilirsiniz. Bütün filtrelerin :class: `xadmin.filters.BaseFilter`'dan türemesi gerekir. :attr: `xadmin.filters.manager`'ı filtreleri kaydetmek için kullanabilirsiniz.

source: 图表插件
tr: grafik eklentisi

source: 在数据列表页面, 跟列表数据生成图表. 可以指定多个数据列, 生成多个图表.
tr: Bir listeleme sayfasında bulunan veriden veri grafiği oluşturulabilir. Daha fazla grafik oluşturmak için farklı sayıda veri kolonları belirtebilirsiniz.

source: 在 Model OptionClass 中设定 ``data_charts`` 属性, 该属性为 dict 类型, key 是图表的标示名称, value 是图表的具体设置属性. 使用示例::
tr: Model OptionClass'ın ``data_charts`` attribute'una bir dictionary atayın. Buradaki anahtar, grafiğin adı ve değer ise özellikleri belirtecektir. Kullanım örnekleri::

source: 图表的主要属性为:
tr: Bir grafiğin ana özellikleri :

source: ``title`` : 图表的显示名称
tr: `title``: grafiğin gösterilen adı

source: ``x-field`` : 图表的 X 轴数据列, 一般是日期, 时间等
tr: 'x-field' alanı grafiğin x-eksenini belirtir. Genelde zaman veya tarih olarak verilir.

source: ``y-field`` : 图表的 Y 轴数据列, 该项是一个 list, 可以同时设定多个列, 这样多个列的数据会在同一个图表中显示
tr: 'y-field' veri grafiklerinin veri alanlarını tutan bir liste olan y-eksenidir. Eğer 'y-field' listesi birden fazla veri içerirse bu verinin hepsi tek bir grafikte gösterilir.

source: ``order`` : 排序信息, 如果不写则使用数据列表的排序
tr: ``order``: sıralama kriteri, eğer verilmezse listedeki sıralama aynı şekilde kullanılır.

source: 书签
tr: Yer imleri

source: 记录数据列表页面特定的数据过滤, 排序等结果. 添加的书签还可以在首页仪表盘中作为小组件添加
tr: Veri filtreleme ve sıralama gibi özel aramaları kaydetmenizi sağlar. Eklenen yer imleri aynı zamanda Index sayfasındaki gösterge paneline küçük bir eklenti olarak eklenebilir.

source: 在 Model OptionClass 中设定如下属性:
tr: Model OptionClass'a aşağıdaki özellikleri girin:

source: ``show_bookmarks`` 属性:
tr: ``show_bookmarks`` özelliği :

source: 设置是否开启书签功能, 默认为 ``True``
tr: yer imleri fonksiyonunu etkinleştir veya etkinleştirme, öntanımlı olarak ``True``

source: ``list_bookmarks`` 属性:
tr: ``list_bookmarks`` özelliği :

source: 设置默认的书签. 用户可以在列表页面添加自己的书签, 你也可以实现设定好一些书签, 使用实例如下::
tr: Öntanımlı yer imlerini belirle. Kullanıcılar kendi yer imlerini listeleme sayfalarına ekleyebilir. Ayrıca ek yer imleri de tanımlayabilirisiniz. Kullanım örnekleri :

source: 数据导出
tr: Veri Dışa Alımı

source: 该插件在数据列表页面提供了数据导出功能, 可以导出 Excel, CSV, XML, json 格式.
tr: Bu eklenti veri listeleme sayfalarında verinin dışa alımını sağlar. Veri Excel, CSV, XML veya json formatında dışa alınabilir.

source: 如果想要导出 Excel 数据, 需要安装 `xlwt <http://pypi.python.org/pypi/xlwt>`_.
tr: Excel formatında veri dışa alabilmek için, öncelikle `xlwt <http://pypi.python.org/pypi/xlwt>`'i kurmalısınız.

source: 默认情况下, xadmin 会提供 Excel, CSV, XML, json 四种格式的数据导出. 您可以通过设置 OptionClass 的 ``list_export`` 属性来指定使用 哪些导出格式 (四种各使用分别用 ``xls``, ``csv``, ``xml``, ``json`` 表示), 或是将 ``list_export`` 设置为 ``None`` 来禁用数据导出功能. 示例如下::
tr: Öntanımlı olarak xadmin veri dosyalarını Excel, CSV, XML ve JSON formatında dışa alabilir. Desteklenen dışa alım formatı OptionClass'ın (değerleri xls, cvs, xml ve json olabilen) 'list_export' kısmında tanımlanabilir. Veri dışa alımını pasifleştirmek için list_export a None değerini atayabilirsiniz.

source: 列表定时刷新
tr: Verilen aralıklarda listeyi yenile

source: 该插件在数据列表页面提供了定时刷新功能, 对于需要实时刷新列表页面查看即时数据的情况非常有用.
tr: Bu eklenti gerçek zamanlı veriyi bir listeleme sayfasından izleyebilmek için çok faydalı olan yenileme özelliği sağlar

source: 使用数据刷新插件非常简单, 设置 OptionClass 的 ``refresh_times`` 属性即可. ``refresh_times`` 属性是存有刷新时间的数组. xadmin 默认不开启该插件. 示例如下::
tr: Yenileme fonksiyonu eklentisini etkinleştirmek için, OptionClass'ın 'refresh_times' alanına bir değer girebilirsiniz. 'refresh_times' aralıkları tutan bir listedir. Öntanımlı olarak bu eklenti aktif değildir. Aşağıdaki örneğe göz atabilirsiniz :

source: 显示数据详情
tr: Veri Detayını Göster

source: 该插件可以在列表页中显示相关字段的详细信息, 使用 Ajax 在列表页中显示.
tr: Eklenti Ajax kullanarak bir listeleme sayfasındaki uygun alanların detaylarının gösterilmesini sağlar.

source: 使用该插件主要设置 OptionClass 的 ``show_detail_fields``, ``show_all_rel_details`` 两个属性. ``show_detail_fields`` 属性设置哪些字段要显示详细信息, ``show_all_rel_details`` 属性设置时候自动显示所有关联字段的详细信息, 该属性默认为 ``True``. 示例如下::
tr: Bu eklentiyi kullanmak için OptionClass'ta bulunan 'show_detail_fields' ve 'show_all_rel_details' alanlarına değer girebilirsiniz. 'show_detail_fields' alanı detayda gösterilecek alanları belirler, aynı şekilde 'show_all_rel_details''a True atandığında, öntanımlı değerdir ilgili bütün alanlar detar kısmında görüntülenir. Lütfen aşağıdaki örneğe göz atın :

source: 数据即时编辑
tr: Anında veri değiştirme

source: 该插件可以在列表页中即时编辑某字段的值, 使用 Ajax 技术, 无需提交或刷新页面即可完成数据的修改, 对于需要频繁修改的字段(如: 状态)相当有用.
tr: Bir alanın değerini hızlıca değiştirebilmek için bu eklenti Ajax kullanır. Veriyi yenilemek için sayfayı post etmek veya yenilemeye gerek yoktur. Hızlıca değiştirilebilecek alanlar için oldukça faydalıdır, (örneğin state)

source: 使用该插件主要设置 OptionClass 的 ``list_editable`` 属性. ``list_editable`` 属性设置哪些字段需要即时修改功能. 示例如下::
tr: Bu eklenti OptionClass'ın 'list_editable' alanına değer girilerek aktive edilebilir. 'list_editable' listeleme sayfasındaki değiştirilebilen alanları belirleyen bir tuple'dır.
