Repository: 0000-bigtree/xadmin
Catalog: docs/locale/*/LC_MESSAGES/quickstart.po
Languages: es_es

source: 快速开始 Xadmin
es_es: Guía rápida de Xadmin

source: For using |xadmin|, `Django 1.4 <http://www.djangoproject.com>`_ needs to be installed and an `Admin Site <http://docs.djangoproject.com/en/dev/ref/contrib/admin/>`_ has to be activated.
es_es: Para usar |xadmin|, es necesaria la instalación de `Django 1.4 <http://www.djangoproject.com>`_y el panel de control `Admin Site <http://docs.djangoproject.com/en/dev/ref/contrib/admin/>`_ha de ser activado.

source: 安装
es_es: Instalación

source: 使用 ``pip``::
es_es: Usando ``pip``::

source: **源码安装**
es_es: **Instalación usando el código fuente**

source: 到 https://github.com/sshwsfc/django-xadmin 下载最新的源码包或是 clone git 库, 然后在项目目录下执行::
es_es: Descarga el último archivo tar del código fuente desde https://github.com/sshwsfc/django-xadmin o clonando ``git clone`` el repositorio. Una vez descargado, ejecuta lo siguiente en el directorio del proyecto::

source: 在执行前您可以先编辑文件 ``requirements.txt`` , 其中 ``xlwt`` 不是必选的, 如果您不需要导出 excel 的功能, 可以删除这项
es_es: Antes de ejecutar puedes editar el fichero de prerequisitos ``requirements.txt``. Ten en cuenta que ``xlwt`` no es necesario; puedes borrar este prerequisito si no necesitas exportar archivos Excel.

source: 运行 Demo
es_es: Demostración

source: 如果您下载的是 |xadmin| 的源码包, 您会在项目目录下找到 ``demo_app`` 目录, 执行一下命令可以迅速开启一个 |xadmin| 的演示实例::
es_es: Si has descargado el archivo tar del código fuente de |xadmin|, tienes la posibilidad de encontrar el directorio ``demo_app`` en la carpeta del proyecto. Los siguientes comandos te pueden servir para crear rápidamente una instancia de demostración de |xadmin|::

source: 打开浏览器, 输入 ``http://127.0.0.1:8000`` 看一下效果吧.
es_es: Introduce en tu navegador la dirección ``http://127.0.0.1:8000`` para ver el resultado.

source: 使用在自己的项目中
es_es: Trabajando con proyectos existentes

source: |xadmin| 作为 Django 的模块, 可以很方便的使用在 Django 的网站中.
es_es: Debido a que es una aplicación, |xadmin| puede ser fácilmente integrado en cualquier sitio desarrollado con Django.

source: 首先编辑 ``settings.py`` 添加 |xadmin| 的模块到 ``INSTALLED_APPS`` 中 (注意, 安装 Django admin 所需要的 APP 也要安装, 但是 django.admin 可以不安装)::
es_es: Primero, edita tu archivo ``settings.py`` para añadir |xadmin| a tus ``INSTALLED_APPS``. (Ten en cuenta que las dependencias de la instalación original del panel de administración de Django han de ser instaladas también, pero el propio panel de administración no es necesario)::

source: 然后添加 URL-patterns 以及 ``autodiscover`` 操作::
es_es: Una vez hecho esto, añade patrones de URLs y haz ``autodiscover``::

source: 收集 media 文件::
es_es: Buscar archivos multimedia::
